---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.SeparationWithOddJunction
source: html/184d8123-4848-4594-c8f9-c820d3bb1a4b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.SeparationWithOddJunction Property

Hydraulic separation requires an even number of junctions on the header pipe for accurate calculations. Add or remove junctions to complete the separation.

## Syntax (C#)
```csharp
public static FailureDefinitionId SeparationWithOddJunction { get; }
```